package com.nikita.shop.database.entity.embeddable;

public enum ProductCategory {
    ELECTRONICS,          // Электроника (смартфоны, ноутбуки, планшеты)
    COMPUTERS,            // Компьютеры и комплектующие
    HOME_APPLIANCES,      // Бытовая техника (холодильники, стиральные машины)
    FURNITURE,            // Мебель (диваны, столы, стулья)
    CLOTHING,             // Одежда (футболки, джинсы, куртки)
    SHOES,                // Обувь (кроссовки, туфли, сапоги)
    ACCESSORIES,          // Аксессуары (сумки, ремни, очки)
    BEAUTY,               // Красота и уход (косметика, парфюмерия)
    HEALTH,               // Здоровье (витамины, медицинские приборы)
    SPORTS,               // Спорт и фитнес (тренажёры, спортивная одежда)
    TOYS,                 // Игрушки (детские игрушки, конструкторы)
    BOOKS,                // Книги (художественная литература, учебники)
    STATIONERY,           // Канцелярия (ручки, блокноты, бумага)
    PET_SUPPLIES,         // Товары для животных (корм, игрушки для питомцев)
    AUTOMOTIVE,           // Автотовары (аксессуары для автомобилей)
    GARDEN,               // Сад и огород (инструменты, растения)
    FOOD,                 // Продукты питания (бакалея, напитки)
    BABY_PRODUCTS,        // Товары для детей (подгузники, коляски)
    JEWELRY,              // Ювелирные изделия (кольца, серьги, цепочки)
    ART                   // Искусство и хобби (краски, холсты, наборы для творчества)
}
